In [1]:
# Import the libraries
import pandas as pd
import numpy as np

**Create a data Frame**

In [3]:
raw_data = {'name': ['Rishi Arora', 'Rachit  Mutreja', 'Ajay Bandi', 'Amar Sachdeva'],
        'age': [30, 29, 32, 33],
        'favorite_color': ['blue', 'red', 'yellow', "green"],
        'grade': [88, 92, 95, 70]}
df = pd.DataFrame(raw_data, index = ['Rishi Arora', 'Rachit  Mutreja', 'Ajay Bandi', 'Amar Sachdeva'])
df

                 age favorite_color  grade             name
Rishi Arora       30           blue     88      Rishi Arora
Rachit  Mutreja   29            red     92  Rachit  Mutreja
Ajay Bandi        32         yellow     95       Ajay Bandi
Amar Sachdeva     33          green     70    Amar Sachdeva

**drop a row by name**

In [5]:
df.drop(['Rishi Arora', 'Ajay Bandi'])

                 age favorite_color  grade             name
Rachit  Mutreja   29            red     92  Rachit  Mutreja
Amar Sachdeva     33          green     70    Amar Sachdeva

**drop a row by number**

In [6]:
df.drop(df.index[0], inplace=True)
df

                 age favorite_color  grade             name
Rachit  Mutreja   29            red     92  Rachit  Mutreja
Ajay Bandi        32         yellow     95       Ajay Bandi
Amar Sachdeva     33          green     70    Amar Sachdeva

**drop first 2 rows (put ':' to left of # to drop last X rows)**

In [8]:
df.drop(df.index[:2], inplace=True)
df

               age favorite_color  grade           name
Amar Sachdeva   33          green     70  Amar Sachdeva

**dropping column by name**

In [9]:
df.drop(['age'], axis = 1, inplace = True)
df

              favorite_color  grade           name
Amar Sachdeva          green     70  Amar Sachdeva